In [1]:
import pandas as pd

In [54]:
df1=pd.read_csv('chicago.csv')
df2=pd.read_csv('new_york_city.csv')
df3=pd.read_csv('washington.csv')

In [68]:
df3

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type
0,1621326,2017-06-21 08:36:34,2017-06-21 08:44:43,489.066,14th & Belmont St NW,15th & K St NW,Subscriber
1,482740,2017-03-11 10:40:00,2017-03-11 10:46:00,402.549,Yuma St & Tenley Circle NW,Connecticut Ave & Yuma St NW,Subscriber
2,1330037,2017-05-30 01:02:59,2017-05-30 01:13:37,637.251,17th St & Massachusetts Ave NW,5th & K St NW,Subscriber
3,665458,2017-04-02 07:48:35,2017-04-02 08:19:03,1827.341,Constitution Ave & 2nd St NW/DOL,M St & Pennsylvania Ave NW,Customer
4,1481135,2017-06-10 08:36:28,2017-06-10 09:02:17,1549.427,Henry Bacon Dr & Lincoln Memorial Circle NW,Maine Ave & 7th St SW,Subscriber
...,...,...,...,...,...,...,...
299995,945535,2017-04-26 03:12:14,2017-04-26 03:41:19,1745.528,Lincoln Memorial,Jefferson Dr & 14th St SW,Customer
299996,1495781,2017-06-11 09:48:52,2017-06-11 10:22:31,2018.450,Key Blvd & N Quinn St,5th & K St NW,Subscriber
299997,12860,2017-01-04 14:33:00,2017-01-04 14:43:00,583.897,17th & K St NW / Farragut Square,7th & F St NW/Portrait Gallery,Subscriber
299998,977621,2017-04-28 07:17:47,2017-04-28 07:56:31,2324.170,Jefferson Dr & 14th St SW,Washington & Independence Ave SW/HHS,Customer
299999,1553359,2017-06-16 04:08:16,2017-06-16 04:29:38,1281.459,10th & Monroe St NE,3rd & H St NW,Customer

In [42]:
df1.shape

(300000, 9)

In [43]:
df1.head()

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0
1,955915,2017-05-25 18:19:03,2017-05-25 18:45:53,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0
2,9031,2017-01-04 08:27:49,2017-01-04 08:34:45,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0
3,304487,2017-03-06 13:49:38,2017-03-06 13:55:28,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0
4,45207,2017-01-17 14:53:07,2017-01-17 15:02:01,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0

In [44]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     300000 non-null  int64
 1   Start Time     300000 non-null  object
 2   End Time       300000 non-null  object
 3   Trip Duration  300000 non-null  int64
 4   Start Station  300000 non-null  object
 5   End Station    300000 non-null  object
 6   User Type      300000 non-null  object
 7   Gender         238948 non-null  object
 8   Birth Year     238981 non-null  float64
dtypes: float64(1), int64(2), object(6)
memory usage: 20.6+ MB

In [45]:
df1.describe()

         Unnamed: 0  Trip Duration     Birth Year
count  3.000000e+05  300000.000000  238981.000000
mean   7.763458e+05     936.239290    1980.858223
std    4.481464e+05    1548.792767      11.003329
min    4.000000e+00      60.000000    1899.000000
25%    3.871368e+05     393.000000    1975.000000
50%    7.771035e+05     670.000000    1984.000000
75%    1.164065e+06    1125.000000    1989.000000
max    1.551500e+06   86224.000000    2016.000000

In [ ]:
# 1- What is the avarege of the dataBirth

In [46]:
df1['Birth Year'].mean

<bound method Series.mean of 0         1992.0
1         1992.0
2         1981.0
3         1986.0
4         1975.0
           ...
299995    1965.0
299996       NaN
299997    1988.0
299998       NaN
299999    1984.0
Name: Birth Year, Length: 300000, dtype: float64>

In [ ]:
# 2- What the highest and the lowest trip duration

In [19]:
print(df1['Trip Duration'].max())
print(df['Trip Duration'].min())

86224
60

In [ ]:
# 3- the averge of Trip Duration

In [20]:
df1['Trip Duration'].mean

<bound method Series.mean of 0          321
1         1610
2          416
3          350
4          534
          ...
299995     590
299996    1139
299997    1368
299998     705
299999    1028
Name: Trip Duration, Length: 300000, dtype: int64>

In [ ]:
# 4- what is the birth year of the person who did the highest trip

In [27]:
df1[df1['Trip Duration']==86224]['Birth Year']

276444   NaN
Name: Birth Year, dtype: float64

In [ ]:
# 5- what are the most 5 stations are started

In [29]:
df1['Start Station'].value_counts()[:5]

Streeter Dr & Grand Ave         6911
Clinton St & Washington Blvd    4306
Lake Shore Dr & Monroe St       4289
Clinton St & Madison St         3744
Canal St & Adams St             3443
Name: Start Station, dtype: int64

In [ ]:
# 6 - how many male and female in the dataset

In [33]:
df1['Gender'].value_counts()

Male      181190
Female     57758
Name: Gender, dtype: int64

In [35]:
print(df1['Start Time'].mean)
print(df1['End Time'].mean)

<bound method Series.mean of 0         2017-06-23 15:09:32
1         2017-05-25 18:19:03
2         2017-01-04 08:27:49
3         2017-03-06 13:49:38
4         2017-01-17 14:53:07
                 ...
299995    2017-01-21 13:18:00
299996    2017-04-28 19:32:19
299997    2017-02-12 09:59:01
299998    2017-04-16 17:07:15
299999    2017-05-30 12:38:28
Name: Start Time, Length: 300000, dtype: object>
<bound method Series.mean of 0         2017-06-23 15:14:53
1         2017-05-25 18:45:53
2         2017-01-04 08:34:45
3         2017-03-06 13:55:28
4         2017-01-17 15:02:01
                 ...
299995    2017-01-21 13:27:50
299996    2017-04-28 19:51:18
299997    2017-02-12 10:21:49
299998    2017-04-16 17:19:00
299999    2017-05-30 12:55:36
Name: End Time, Length: 300000, dtype: object>

In [ ]:
# 7- how many users there birth year is 1980

In [37]:
df1['Birth Year'].value_counts()[1980]

6603

In [ ]:
# 8- what the average Trip Duration of the customer Type

In [40]:
df1[df1['User Type']=='Customer']['Trip Duration'].mean

<bound method Series.mean of 7          723
19         840
31        2610
35        1211
38        1087
          ...
299988    1218
299989     499
299993    2349
299996    1139
299998     705
Name: Trip Duration, Length: 61110, dtype: int64>

In [ ]:
# 9- what the higest Trip Duration in the 3 cities

In [67]:
max1=df1['Trip Duration'].max()
max2=df2['Trip Duration'].max()
max3=df3['Trip Duration'].max()
max(max1,max2,max3)

2155775

In [ ]:
# 10- where is the end station of higest Trip Duration in washington

In [69]:
df3['Trip Duration'].max()

1235662.17

In [72]:
df3[df3['Trip Duration']==1235662.17]['End Station']

200866    19th St & Constitution Ave NW
Name: End Station, dtype: object